# Hardware და Software
# Hardware (აპარატურა / აპარატული უზრუნველყოფა): ეს არის კომპიუტერის ყველა ის ფიზიკური ნაწილი, რომლის ხელით შეხება, დანახვა და გადაადგილებაც შეგვიძლია. hardware არის კომპიუტერის "სხეული", რომლის გარეშეც პროგრამები ვერ იმუშავებენ.

# მაგალითები:

# მონიტორი (ეკრანი)

# კლავიატურა

# მყარი დისკი (SSD / HDD)

# Software (პროგრამული უზრუნველყოფა): ეს არის კომპიუტერული პროგრამების, ინსტრუქციებისა და წესების ერთობლიობა. Software არის კომპიუტერის "ტვინი" და "აზროვნება" — ის ეუბნება Hardware-ს, თუ რა და როგორ გააკეთოს. ხელით ვერ შევეხებით, მაგრამ ეკრანზე ვხედავთ და ვიყენებთ.

# მაგალითები:

# ოპერაციული სისტემა (მაგ: Windows, macOS)

# ინტერნეტ ბრაუზერი (მაგ: Google Chrome)

# თამაშები ან ტექსტური რედაქტორები (მაგ: Microsoft Word)







# რა არის კომპიუტერი და როგორ ვიყენებთ მას?



# კომპიუტერი არის ელექტრონული მოწყობილობა, რომელსაც შეუძლია ინფორმაციის (მონაცემების) მიღება, დამუშავება, შენახვა და შედეგის გამოტანა. ის ასრულებს სხვადასხვა სირთულის გამოთვლებსა და დავალებებს ადამიანზე შეუდარებლად სწრაფად და ზუსტად.

# როგორ ვიყენებთ მას:

# სწავლისა და სამუშაოსთვის: ტექსტების ასაკრეფად, პრეზენტაციების შესაქმნელად, რთული გამოთვლების ჩასატარებლად და პროგრამირებისთვის.

# ინფორმაციის მოსაძიებლად: ინტერნეტში სიახლეების, წიგნების თუ სტატიების წასაკითხად.

# კომუნიკაციისთვის: ელფოსტის, სოციალური ქსელებისა და ვიდეოზარების (Zoom, Teams) მეშვეობით ადამიანებთან დასაკავშირებლად.

# გართობისთვის: ფილმებისა და ვიდეოების სანახავად, მუსიკის მოსასმენად და თამაშების სათამაშოდ.




# რიცხვების გადაყვანა ათობითიდან ორობით სისტემაში (23-დან 30-ის ჩათვლით)


# 23 =10111
# 24 =11000
# 25 =11001
# 26 =11010
# 27 =11011
# 28 =11100
# 29 =11101
# 30 =11110




# Low და High Level პროგრამირების ენები
# Low-Level (დაბალი დონის) ენა: ეს არის პროგრამირების ენა, რომელიც ძალიან ახლოს დგას კომპიუტერის აპარატურასთან (Hardware-თან) და მანქანურ კოდთან (0-ებთან და 1-ებთან). კომპიუტერს მისი გაგება ძალიან უადვილდება და სწრაფად ასრულებს, თუმცა ადამიანისთვის მისი კითხვა, წერა და გაგება საკმაოდ რთულია (მაგალითად: Assembly ენა).

# High-Level (მაღალი დონის) ენა: ეს არის პროგრამირების ენა, რომელიც შექმნილია ადამიანისთვის — მასში გამოყენებულია ინგლისური სიტყვები, მათემატიკური სიმბოლოები და ლოგიკური სტრუქტურები. ადამიანისთვის მისი სწავლა და კოდის წერა გაცილებით მარტივია, თუმცა კომპიუტერს სჭირდება სპეციალური "თარგმნა" (კომპილაცია/ინტერპრეტაცია), რათა ის თავისთვის გასაგებ 0-ებად და 1-ებად აქციოს (მაგალითად: Python, C++, JavaScript).