# 1.კომენტარის სახით ჩამოწერეთ გაკვეთილზე ნასწავლი მონაცემთა ტიპები და მოიყვანეთ მაგალითები
# - Integer (int): მთელი რიცხვი, მაგალითად: x = 10
# - Float (float): ათწილადი რიცხვი, მაგალითად: price = 19.99
# - String (str): ტექსტური მონაცემი, მაგალითად: name = "იოანე"
# - Boolean (bool): ლოგიკური ტიპი (True ან False), მაგალითად: is_logged_in = True


# 2. შექმენით 2 ცვლადი x და y, შეასრულეთ მათემატიკური ოპერაციები და დაპრინტეთ
x = 16
y = 4

print(x+y)
print(x-y)
print(x*y)
print(x/y)




#3. შექმენით 2 ცვლადი: width, height და დაპრინტეთ მართკუთხედის ფართობი/პერიმეტრი


width = 10 
height = 5
perimeter = 2 * (width + height)
area=5*10
perimeter=2*15

print(area)
print(perimeter)


#4.კომენტარის სახით ახსენით რა არის კონკატენაცია და დაწერეთ მაგალითი.



#რა არის კონკატენაცია?


#კონკატენაცია (Concatenation) არის პროგრამირების ტერმინი, რომელიც ნიშნავს ორი ან მეტი ტექსტის (სტრინგის) ერთმანეთზე მიწებებას + ნიშნის გამოყენებით.
#წარმოიდგინეთ ლეგოს კუბიკები, რომლებზეც ასოები წერია. როდესაც ორ კუბიკს ერთმანეთს მიაბრუნებთ, ისინი ერთ დიდ სიტყვად იქცევა. პროგრამირებაში ტექსტებიც ზუსტად ასე იწებება.




#კონკატენაცია (Concatenation) არის ორი ან მეტი ტექსტის (სტრინგის) 
# ერთმანეთზე მიწებება პლიუს (+) ნიშნის გამოყენებით.

# შევქმნათ ორი ტექსტური ცვლადი
first_name = "ანა"
last_name = "ბერიძე"

# ვუწერთ მათ ერთმანეთს კონკატენაციით (შუაში ვამატებთ ცარიელ ბრჭყალებს სფეისისთვის)
full_name = first_name + " " + last_name
#ანა ბერიძე=ანა + " " + ბერიძე
print(full_name)









#5.შექმენით 3 ცვლადი: name, age, height შიგნით შეინახეთ შესაბამისი მონაცემთა ტიპის მნიშვნელობა და დაპრინტეთ


name="luka"
age=22
height=1.82

print(name)
print(age)
print(height)

