# 1.კომენტარის სახით ჩამოწერეთ გაკვეთილზე ნასწავლი მონაცემთა ტიპები და მოიყვანეთ მაგალითები
# - Integer (int): მთელი რიცხვი, მაგალითად: x = 10
# - Float (float): ათწილადი რიცხვი, მაგალითად: price = 19.99
# - String (str): ტექსტური მონაცემი, მაგალითად: name = "იოანე"
# - Boolean (bool): ლოგიკური ტიპი (True ან False), მაგალითად: is_logged_in = True


# 2. შექმენით 2 ცვლადი x და y, შეასრულეთ მათემატიკური ოპერაციები და დაპრინტეთ
x = 16
y = 4

print(x+2)=20
print(x-y)=12
print(x*y)=64
print(x/y)=4




3.# შექმენით 2 ცვლადი: width, height და დაპრინტეთ მართკუთხედის ფართობი/პერიმეტრი


width = 10 
height = 5
perimeter = 2 * (width + height)
area=5*10=50
perimeter=2*15=30

print(area,50)
print(perimeter,30)


4.#კომენტარის სახით ახსენით რა არის კონკატენაცია და დაწერეთ მაგალითი.



#რა არის კონკატენაცია?


#კონკატენაცია (Concatenation) არის პროგრამირების ტერმინი, რომელიც ნიშნავს ორი ან მეტი ტექსტის (სტრინგის) ერთმანეთზე მიწებებას + ნიშნის გამოყენებით.
#წარმოიდგინეთ ლეგოს კუბიკები, რომლებზეც ასოები წერია. როდესაც ორ კუბიკს ერთმანეთს მიაბრუნებთ, ისინი ერთ დიდ სიტყვად იქცევა. პროგრამირებაში ტექსტებიც ზუსტად ასე იწებება.




#კონკატენაცია (Concatenation) არის ორი ან მეტი ტექსტის (სტრინგის) 
# ერთმანეთზე მიწებება პლიუს (+) ნიშნის გამოყენებით.

# შევქმნათ ორი ტექსტური ცვლადი
first_name = "ანა"
last_name = "ბერიძე"

# ვუწერთ მათ ერთმანეთს კონკატენაციით (შუაში ვამატებთ ცარიელ ბრჭყალებს სფეისისთვის)
full_name = first_name + " " + last_name
#ანა ბერიძე=ანა + " " + ბერიძე
print("ანა_ბერიძე")





3.#შექმენით 3 ცვლადი: name, age, height შიგნით შეინახეთ შესაბამისი მონაცემთა ტიპის მნიშვნელობა და დაპრინტეთ


print("name:(ლუკა)")
print("age:(22)")
print("height:(1.82)")
